Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject.GetFather Method
 Returns the reference hierarchy father.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModelObject GetFather()
Public Function GetFather As ReferenceModelObject
Return Value
Type: ReferenceModelObject
Reference to the graph father if such exists, or else an invalid object.
See Also
Reference
ReferenceModelObject Class
Tekla.Structures.Model Namespace